In [67]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n
import math
import matplotlib.pyplot as plt
%matplotlib inline

In [68]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [69]:
experience = []
expr = df.experience
checking = df.experience.isnull()
for x in expr:
    if type(x) == type(2.2):
        experience.append('zero')
    else :
        experience.append(x)
print(experience)

['zero', 'zero', 'five', 'two', 'seven', 'three', 'ten', 'eleven']

In [70]:
values = []
for x in experience:
    values.append(w2n.word_to_num(x))
df.experience = values
print(values)

[0, 0, 5, 2, 7, 3, 10, 11]

In [71]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [72]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [73]:
df = df.rename(columns = {'experience':'experience', 'test_score(out of 10)':'test_score', 
                          'interview_score(out of 10)':'interview_score', 'salary($)' : 'salary'})

In [74]:
#df.test_score = df.test_score.fillna(df.test_score.median()) #nan = 8
Mean = math.floor(df.test_score.mean())
df.test_score = df.test_score.fillna(Mean) #nan = 7

In [75]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         7.0                7   72000
7          11         7.0                8   80000

In [ ]:
#d.experience = d.experience.fillna("zero")
#d.experience = d.experience.apply(w2n.word_to_num)

In [76]:
reg = linear_model.LinearRegression()
X = df[['experience', 'test_score', 'interview_score']]
Y = df['salary']
reg.fit(X, Y)

LinearRegression()

In [77]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [78]:
reg.predict([[12,10,10]])

array([93747.79628651])